#### 📝 Terraform Plan 📝
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.modtm_module_source.telemetry[0]: Reading...
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.logicapp["lxr-app-1"].module.avm-res-web-site.data.modtm_module_source.telemetry[0]: Reading...
module.logicapp["lxr-app-1"].module.avm-res-web-site.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.logicapp["lxr-app-1"].module.avm-res-web-site.data.azapi_client_config.telemetry[0]: Reading...
module.logicapp["lxr-app-1"].module.avm-res-web-site.data.azapi_client_config.telemetry[0]: Read complete after 1s [id=clientConfigs/subscriptionId=8ebd8617-f6fd-4ada-b661-f7332683bee4;tenantId=68c917de-20e3-4751-9ccc-cbbe32e11325]
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.azurerm_location.region: Reading...
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.azurerm_client_config.telemetry[0]: Reading...
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kYTdlNjE5My02NThjLTQwZmItODBiNy03ODVjZTg4YmVkOTk7b2JqZWN0SWQ9OWI3MGVjNjEtYjQzNi00ZDI2LTkzMDMtMGM2MzA2OGY5MjUwO3N1YnNjcmlwdGlvbklkPThlYmQ4NjE3LWY2ZmQtNGFkYS1iNjYxLWY3MzMyNjgzYmVlNDt0ZW5hbnRJZD02OGM5MTdkZS0yMGUzLTQ3NTEtOWNjYy1jYmJlMzJlMTEzMjU=]
module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.data.azurerm_location.region: Read complete after 1s [id=/subscriptions/8ebd8617-f6fd-4ada-b661-f7332683bee4/locations/uksouth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg["lxr-app-1"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-lxr-app-1"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_resource_group.shared will be created
  + resource "azurerm_resource_group" "shared" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "lxr-rg-shared"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
    }

  # azurerm_user_assigned_identity.example will be created
  + resource "azurerm_user_assigned_identity" "example" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "id-logicapp"
      + principal_id        = (known after apply)
      + resource_group_name = "lxr-rg-shared"
      + tenant_id           = (known after apply)
    }

  # module.logicapp["lxr-app-1"].azurerm_storage_account.example will be created
  + resource "azurerm_storage_account" "example" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stworkflow1devuks01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-lxr-app-1"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.naming["lxr-app-1"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.naming["lxr-app-1"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "plan-lxr-app-1-uks-dev"
      + os_type                         = "Windows"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-lxr-app-1"
      + sku_name                        = "WS1"
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + worker_count                    = 3
      + zone_balancing_enabled          = true
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "uksouth"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-web-serverfarm/azurerm"
          + "module_version"  = "0.7.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "8ebd8617-f6fd-4ada-b661-f7332683bee4"
          + "tenant_id"       = "68c917de-20e3-4751-9ccc-cbbe32e11325"
        }
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-serverfarm.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-site.azurerm_logic_app_standard.this[0] will be created
  + resource "azurerm_logic_app_standard" "this" {
      + app_service_plan_id                      = (known after apply)
      + app_settings                             = {
          + "FUNCTIONS_WORKER_RUNTIME" = "dotnet"
        }
      + bundle_version                           = "[1.*, 2.0.0)"
      + client_affinity_enabled                  = false
      + client_certificate_mode                  = "OptionalInteractiveUser"
      + custom_domain_verification_id            = (known after apply)
      + default_hostname                         = (known after apply)
      + enabled                                  = true
      + ftp_publish_basic_authentication_enabled = true
      + https_only                               = true
      + id                                       = (known after apply)
      + kind                                     = (known after apply)
      + location                                 = "uksouth"
      + name                                     = "logic-lxr-app-1-uks-dev"
      + outbound_ip_addresses                    = (known after apply)
      + possible_outbound_ip_addresses           = (known after apply)
      + public_network_access                    = "Enabled"
      + resource_group_name                      = "rg-lxr-app-1"
      + scm_publish_basic_authentication_enabled = true
      + site_credential                          = (known after apply)
      + storage_account_access_key               = (sensitive value)
      + storage_account_name                     = "stworkflow1devuks01"
      + storage_account_share_name               = (known after apply)
      + tags                                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
        }
      + use_extension_bundle                     = true
      + version                                  = "~4"
      + vnet_content_share_enabled               = false

      + connection_string (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned, UserAssigned"
        }

      + site_config {
          + always_on                        = true
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = "v4.0"
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = "FtpsOnly"
          + health_check_path                = "/"
          + http2_enabled                    = false
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = "1.2"
          + pre_warmed_instance_count        = (known after apply)
          + public_network_access_enabled    = (known after apply)
          + runtime_scale_monitoring_enabled = false
          + scm_min_tls_version              = "1.2"
          + scm_type                         = "None"
          + scm_use_main_ip_restriction      = false
          + use_32_bit_worker_process        = false
          + vnet_route_all_enabled           = false
          + websockets_enabled               = false
        }
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-site.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "uksouth"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-web-site/azurerm"
          + "module_version"  = "0.19.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "8ebd8617-f6fd-4ada-b661-f7332683bee4"
          + "tenant_id"       = "68c917de-20e3-4751-9ccc-cbbe32e11325"
        }
    }

  # module.logicapp["lxr-app-1"].module.avm-res-web-site.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

